# Consistency Checks

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
path = r'C:\Users\aaron\OneDrive\Documents\CF Analysis 4'

In [5]:
df_prods = pd.read_csv(os.path.join(path, '2 Data', 'Original Data', 'products.csv'), index_col = False)

In [7]:
df_ords = pd.read_csv(os.path.join(path, '2 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

Mixed-Type Data

In [8]:
# create a dataframe
df_test = pd.DataFrame()

In [9]:
# create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [13]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [15]:
df_test['mix'] = df_test['mix'].astype('str')

Missing Values

In [17]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [19]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [21]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [23]:
df_prods = df_prods[df_prods['product_name'].isnull() == False]

In [25]:
df_prods.shape

(49677, 5)

Duplicates

In [27]:
df_dups = df_prods[df_prods.duplicated()]

In [29]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [31]:
df_prods = df_prods.drop_duplicates()

In [33]:
df_prods.shape

(49672, 5)

In [35]:
df_prods.to_csv(os.path.join(path, '2 Data','Prepared Data', 'products_cleaned.csv'))

# Task 4.5

Part 2

In [72]:
# looking at the ords dataframe
df_ords.describe()

,number_of_consecutive_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.715486e+01,2.776219e+00,1.645532e+08,1.111484e+01
std,1.773316e+01,2.046829e+00,3.043603e+11,9.206737e+00
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,1.000000e+02,6.000000e+00,5.629500e+14,3.000000e+01

The max value for order_hour_of_day is 562950000000000, when it should only go up to 24.

Also the min value for both order_day_of_week and order_hour_of_day is 0. while midnight being represented as 0 instead of 24 makes sense, seeing a day of the week being represented as 0 insted of 7 doesn't.

Part 3

In [86]:
# checking for mixed types
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

C:\Users\aaron\AppData\Local\Temp\ipykernel_15776\2300039103.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\aaron\AppData\Local\Temp\ipykernel_15776\2300039103.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\aaron\AppData\Local\Temp\ipykernel_15776\2300039103.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\aaron\AppData\Local\Temp\ipykernel_15776\2300039103.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\aaron\AppData\Local\Temp\ipykernel_15776\2300039103.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\aaron\AppData\Local\Temp\ipykernel_15776\2300039103.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)

I don't think there are any mixed data types

Part 5

In [91]:
# looking for missing values
df_ords.isnull().sum()

order_id                             0
user_id                              0
number_of_consecutive_orders         0
orders_day_of_week                   0
order_hour_of_day                    0
days_since_prior_order          206209
dtype: int64

In [95]:
df_ords.tail()

,order_id,user_id,number_of_consecutive_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [97]:
df_nan2 = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [99]:
df_nan2

,order_id,user_id,number_of_consecutive_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

The number of missing values is equal to the number of users, and all of theas missing values are in the days_since_prior_order column.

Also all of these missing values are showing up in every users first order, because there are no prior orders to mark down.

These missing values are not mistakes to correct. There all there for a reason.

Part 7

In [104]:
# checking for duplicates
df_dups2 = df_ords[df_ords.duplicated()]

In [106]:
df_dups2

Empty DataFrame
Columns: [order_id, user_id, number_of_consecutive_orders, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

There are no duplicates

Part 9

In [111]:
# Exporting data
df_ords.to_csv(os.path.join(path, '2 Data','Prepared Data', 'orders_cleaned.csv'))